tap 'thoughtbot/formulae' # Needed for rcm
brew 'rcm' # Dotfile Manager https://github.com/thoughtbot/rcm

brew 'coreutils'
brew 'gnu-tar'
brew 'bash'
brew 'bash-completion'

brew 'git'
brew 'jq'
brew 'parallel'
brew 'pgcli'

cask 'amethyst' # Window Manager https://ianyh.com/amethyst/

brew 'rbenv'
brew 'ruby-build'

brew 'exenv'
brew 'erlang'
brew 'elixir-build'

# Tools for commit signing
brew 'gnupg'
brew 'gpg-agent'
brew 'pinentry-mac'

brew 'fzf' # A command-line fuzzy finder https://github.com/junegunn/fzf

