brew 'rcm' # Dotfile Manager https://github.com/thoughtbot/rcm

brew 'coreutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'bash'
brew 'bash-completion'
brew 'starship'
brew 'curl'
brew 'htop'
brew 'tree'
brew 'unar'
brew 'watch'
brew 'z'

brew 'git'
brew 'git-lfs'
brew 'jq'
brew 'parallel'
brew 'pgcli'

brew 'ruby-build'
brew 'asdf'

brew 'fzf' # A command-line fuzzy finder https://github.com/junegunn/fzf

cask 'docker'
cask 'google-chrome'
cask 'ghostty'
cask 'visual-studio-code'
cask 'maccy'
cask 'obsidian'
cask 'signal'
cask 'spotify'

mas 'Bitwarden', id: 1352778147
mas 'Magnet', id: 441258766
mas 'Xcode', id: 497799835
