tap 'thoughtbot/formulae' # Needed for rcm
brew 'rcm' # Dotfile Manager https://github.com/thoughtbot/rcm

brew 'coreutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'bash'
brew 'bash-completion'
brew 'curl'
brew 'htop'
brew 'the_silver_searcher'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'z'

brew 'git'
brew 'jq'
brew 'parallel'
brew 'pgcli'

brew 'rbenv'
brew 'ruby-build'

brew 'exenv'
brew 'erlang'
brew 'elixir-build'

# Tools for commit signing
brew 'gnupg'
brew 'pinentry-mac'

brew 'fzf' # A command-line fuzzy finder https://github.com/junegunn/fzf

# Kubernetes Enviroment
brew 'kubectl'
# Kubectx (https://github.com/ahmetb/kubectx) provides following binaries:
# * kctx - switch k8s context
# * kns - swtich k8s namespace
brew 'kubectx', args: %w[with-short-names]
cask 'minikube'

brew 'awscli'
cask 'aws-vault'

cask 'dropbox'
cask 'docker'
# Installs latest 1password. With the lifetime license you can only use 1password 6.
# Download and install it from here: https://app-updates.agilebits.com/download/OPM4
# cask '1password'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'caffeine'
cask 'iterm2'
cask 'visual-studio-code'
cask 'clipy'
